from gemma_analyzer import analyze_job
import json

# 🧪 Тестовые вакансии разных типов

TEST_JOBS = [
    {
        "name": "Python Automation",
        "description": """
        Требуется Python разработчик для автоматизации парсинга данных.
        Необходимо создать скрипт, который будет собирать информацию с 10+ сайтов,
        обрабатывать данные и сохранять в Excel.
        Бюджет: $150-300. Срок: 3-5 дней.
        """
    },
    {
        "name": "VFX Motion Graphics",
        "description": """
        Ищу After Effects специалиста для создания kinetic typography анимации.
        Длительность: 30 секунд. Нужны сложные эффекты и transitions.
        Платим $200-400. Срочный проект!
        """
    },
    {
        "name": "Telegram Bot",
        "description": """
        Нужен простой Telegram бот на Python.
        Функции: приём команд, отправка уведомлений, работа с базой данных SQLite.
        Бюджет: $80-120. Deadline: 2 дня.
        """
    },
    {
        "name": "Website Design",
        "description": """
        Требуется веб-дизайнер для создания лендинга на WordPress.
        Нужен современный дизайн, адаптив, интеграция с CRM.
        Бюджет: $500-800. Срок: 2 недели.
        """
    },
    {
        "name": "Discord Bot + Scraper",
        "description": """
        Создать Discord бота, который будет парсить RSS фиды и отправлять новости.
        Python + discord.py + feedparser.
        Платим $100. Срочно нужно!
        """
    }
]


def run_tests():
    """Запускает тесты на всех примерах вакансий"""
    print("="*60)
    print("🔬 [ТЕСТИРОВАНИЕ] AI Sales Agent — Модуль 'Ядро'")
    print("="*60 + "\n")
    
    results = []
    
    for idx, job in enumerate(TEST_JOBS, 1):
        print(f"\n{'─'*60}")
        print(f"📋 ВАКАНСИЯ #{idx}: {job['name']}")
        print(f"{'─'*60}")
        print(f"Описание: {job['description'].strip()[:100]}...")
        print()
        
        # Анализируем вакансию
        result = analyze_job(job['description'])
        results.append({
            "job": job['name'],
            "analysis": result
        })
        
        # Красивый вывод результата
        print(f"\n🎯 ОЦЕНКА: {result['score']}/10")
        print(f"💡 ОБОСНОВАНИЕ: {result['reasoning']}")
        print(f"✉️ ОТКЛИК:\n   {result['bid_draft']}")
        print()
    
    # Итоговая таблица
    print("\n" + "="*60)
    print("📊 ИТОГОВАЯ ТАБЛИЦА")
    print("="*60)
    print(f"{'Вакансия':<30} {'Оценка':<10}")
    print("-"*60)
    
    for r in results:
        print(f"{r['job']:<30} {r['analysis']['score']}/10")
    
    print("="*60)
    
    # Сохраняем результаты
    with open("analysis_results.json", "w", encoding="utf-8") as f:
        json.dump(results, f, ensure_ascii=False, indent=2)
    
    print("\n💾 Результаты сохранены в: analysis_results.json")
    print("✅ Тестирование завершено!\n")


if __name__ == "__main__":
    run_tests()
